biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."id" ASC
---
    def index
        auctions = Auction.order(id: :asc)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_auction
        @auction = Auction.find params[:id]